<?php
/*  PHP面向对象的程序设计
 *
 *  PHP5 
 *
 *  数组和对象 ： 都属于PHP的复合类型（一个变量可以存储多个单元）
 *
 *  对象比数组更强大， 不仅可以存储多个数据，还可以将函数存在对象
 *
 *  对象的三大特性： 封装、继承、多态
 *
 *  面向对象编程（oop  ）
 *
 *  面向对象和面向过程这间的区别
 *  
 *     最小的单位： 函数
 *     最小的单位： 对象
 *
 *  什么是对象 
 *    对象就是东西， 一个实体
 *
 *    20桌子、20椅子
 *    
 *    电话： 
 *      对象中有什么？
 *
 *      品牌, 颜色，电池，大小，  。。。。
 *
 *      打电话、发信息， 听音乐， 。。。。
 *
 *      
 *      对象：成员
 *      	成员属性==变量==定义对象的外观和状态
 *      	成员方法==函数==定义对象的功能的
 *
 *      文章：
 *      	标题、作者、来源、访问数
 *
 *      	添加、修改、删除 。。。。。 。。。 
 *      
 *     电子商城： 用户、购物车、商品、分类、定单、图片、文件对象 ...  
 *
 *  什么是类
 *    分类、类型、自己类型
 *
 *     桌子、椅子，电脑
 *    
 *     在类中定义这个类型的属性和方法
 *
 *
 *     
 *      
 *
 *  类和对象之间一个关系
 *
 *   声明类-->实例化对象（创建对象）--->用对象
 *
 *   配置单    电脑          ---用电脑
 *
 *   配置单：
 *
 *      CPU:  E7400 2.8 
 *      内存： 2G DDR3
 *      显示： 512 9300
 *      主板： 
 *     
 *      price: 
 *
 *
 *      定义出一个电脑的类型（配置单就类）
 *
 *      安装出100台电脑（每个电脑就是一个对象）
 *
 *
 *      
 *     类     声明类
 *
 *     对象   创建对象
 *
 *
 *     成员属性 ： 
 *
 *     成员方法 ：
 *     		在声明类时，类中的成员就是成员属性和成员方法，对这个类创建的对象中的内容，就是你在类中声明的内容
 *
 *     类和对象之间的关系
 *
 *     并不是面向对象的语法难，
 *
 *     最难的就是如果设计出面向对象的程序
 *
 *     参考《细说PHP》的第8章
 *  
 *    
 *     
 *
 */
